[
  {
    "raw_text": "2024\n1\nAllbritton-King JD, García-Cardeña G.\nEndothelial cell dysfunction in cardiac disease: Driver or consequence?\nFront Cell Dev Biol. 2023 Oct 25;11:1278166.\nhttps://doi.org/10.3389/fcell.2023.1278166\nJournal Impact Factor: 5.5\n2\nAl-Turki TM, Maranon DG, Nelson CB, Lewis AM, Luxton JJ, Taylor LE, Altina N, Wu F, Du H,\nKim J, Damle N, Overbey E, Meydan C, Grigorev K, Winer DA, Furman D, Mason CE, Bailey SM.\nTelomeric RNA (TERRA) increases in response to spaceflight and high-altitude climbing.\nCommun Biol. 2024 Jun 11;7:698.\nhttps://doi.org/10.1038/s42003-024-06014-x\nJournal Impact Factor: 5.9\n3\nAn R, Blackwell VK, Harandi B, Gibbons AC, Siu O, Irby I, Rees A, Cornejal N, Sattler KM, Sheng\nT, Syracuse NC, Loftus D, Santa Maria SR, Cekanaviciute E, Reinsch SS, Ray HE, Paul AM.\nInfluence of the spaceflight environment on macrophage lineages.\nnpj Microgravity. 2024 Jun 11;10:63. Review.\nhttps://doi.org/10.1038/s41526-023-00293-0\nJournal Impact Factor: 5.1\n4\nAndrade MR, Azeez TA, Montgomery MM, Caldwell JT, Park H, Kwok AT, Borg AM, Narayanan\nSA, Willey JS, Delp MD, La Favor JD.\nNeurovascular dysfunction associated with erectile dysfunction persists after long-term\nrecovery from simulations of weightlessness and deep space irradiation.\nFaseb j. 2023 Dec;37(12):e23246.\nhttps://doi.org/10.1096/fj.202300506RR\nJournal Impact Factor: 4.8\n5\nBakshi A, Choi WG, Kim SH, Gilroy S.\nThe vacuolar Ca2+ transporter CATION EXCHANGER 2 regulates cytosolic calcium\nhomeostasis, hypoxic signaling, and response to flooding in Arabidopsis thaliana.\nNew Phytol. 2023 Dec;240(5):1830-1847.\nhttps://doi.org/10.1111/nph.19274\nJournal Impact Factor: 9.4\n6\nBarcenilla BB, Kundel I, Hall E, Hilty N, Ulianich P, Cook J, Turley J, Yerram M, Min J-H, Castillo-\nGonzález C, Shippen DE.\nTelomere dynamics and oxidative stress in Arabidopsis grown in lunar regolith simulant.\nFront Plant Sci. 2024 Feb 15;15:1351613.\nhttps://doi.org/10.3389/fpls.2024.1351613\nJournal Impact Factor: 5.6\n7\nBarcenilla BB, Meyers AD, Castillo-González C, Young P, Min JH, Song J, Phadke C, Land E,\nCanaday E, Perera IY, Bailey SM, Aquilano R, Wyatt SE, Shippen DE.\nArabidopsis telomerase takes off by uncoupling enzyme activity from telomere length\nmaintenance in space.\nNat Commun. 2023 Nov 29;14:7854.\nhttps://doi.org/10.1038/s41467-023-41510-4\nJournal Impact Factor: 16.6\n8\nBiancotti JC, Espinosa-Jeffrey A.\nMetabolomic profiling of the secretome from human neural stem cells flown into space.\nBioengineering (Basel). 2023 Dec 22;11(1):11.\nhttps://doi.org/10.3390/bioengineering11010011\nJournal Impact Factor: 4.6\n9\nBoles HO, Poulet L, Johnson CM, Torres JJ, Koss LL, Spencer LE, Massa GD.\nDesign, build, and testing of hardware to safely harvest microgreens in microgravity.\nGravit Space Res. 2023 Oct 30;11(1):1-14.\nhttps://doi.org/10.2478/gsr-2023-0001\nJournal Impact Factor: Not available for this journal\n10\nBongrand C, Foster JS.\nModeled microgravity impacts Vibrio fischeri population structure in a mutualistic\nassociation with an animal host.\nEnviron Microbiol. 2023 Oct 12.\nhttps://doi.org/10.1111/1462-2920.16522\nJournal Impact Factor: 5.1\n11\nBorg J, Loy C, Kim J, Buhagiar A, Chin C, Damle N, De Vlaminck I, Felice A, Liu T, Matei I,\nMeydan C, Muratani M, Mzava O, Overbey E, Ryon KA, Smith SM, Tierney BT, Trudel G, Zwart\nSR, Beheshti A, Mason CE, Borg J.\nSpatiotemporal expression and control of haemoglobin in space.\nNat Commun. 2024 Jun 11;15:4927.\nhttps://doi.org/10.1038/s41467-024-49289-8\nJournal Impact Factor: 16.6\n12\nBunchek JM, Hummerick ME, Spencer LE, Romeyn MW, Young M, Morrow RC, Mitchell CA,\nDouglas GL, Wheeler RM, Massa GD.\nPick-and-eat space crop production flight testing on the International Space Station.\nJ Plant Interact. 2024 Jan 18;19(1):2292220.\nhttps://doi.org/10.1080/17429145.2023.2292220\nJournal Impact Factor: 3.2\n13\nBurke M, Wong K, Talyansky Y, Mhatre SD, Mitchell C, Juran CM, Olson M, Iyer J, Puukila S,\nTahimic CGT, Christenson LK, Lowe M, Rubinstein L, Shirazi-Fard Y, Sowa MB"
  }
]